wyp19960729/FM33L0XX-keil-GCC-/keil project/FM33L0XX_CORE_FILE/Include/FM33L0XX.h

/****************************************************************************************************//**
 * @file     FM33L0XX.h
 *
 * @brief    CMSIS Cortex-M0 Peripheral Access Layer Header File for
 *           FM33L0XX from Keil.
 *
 * @version  V0.1.2
 * @date     20. jun 2019
 *
 * @note     Generated with SVDConv V2.87e 
 *           from CMSIS SVD File 'FM33L0XX.SVD' Version 1.0,
 *
 * @par      ARM Limited (ARM) is supplying this software for use with Cortex-M
 *           processor based microcontroller, but can be equally used for other
 *           suitable processor architectures. This file can be freely distributed.
 *           Modifications to this file shall be clearly marked.
 *           
 *           THIS SOFTWARE IS PROVIDED "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 *           OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 *           MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 *           ARM SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL, OR
 *           CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER. 
 *
 *******************************************************************************************************/



/** @addtogroup Keil
  * @{
  */

/** @addtogroup FM33L0XX
  * @{
  */

#ifndef FM33L0XX_H
#define FM33L0XX_H

#ifdef __cplusplus
extern "C" {
#endif


typedef enum {RESET = 0, SET = !RESET} FlagStatus, ITStatus;
typedef enum {DISABLE = 0, ENABLE = !DISABLE} FunState;
typedef enum {FAIL = 0, PASS = !FAIL} ErrorStatus;

#define __RCHF_INITIAL_CLOCK    (8000000)		/* Value of the Internal RC HIGH oscillator in Hz */
#define __RC4M_CLOCK    				(4000000)		/* Value of the Internal RC 4M oscillator in Hz */
#define __RCLP_CLOCK    				(32000)			/* Value of the Internal RC LOW oscillator in Hz */
#define __XTHF_CLOCK    				(8000000)			/* Value of the EXTERNAL oscillator in Hz */
#define __XTLF_CLOCK    				(32768)			/* Value of the EXTERNAL oscillator in Hz */



/* -------------------------  Interrupt Number Definition  ------------------------ */

typedef enum {
/* -------------------  Cortex-M0 Processor Exceptions Numbers  ------------------- */
  Reset_IRQn                    = -15,              /*!<   1  Reset Vector, invoked on Power up and warm reset                 */
  NMI_IRQn                      = -14,              /*!<   2  Non maskable Interrupt, cannot be stopped or preempted           */
  HardFault_IRQn                = -13,              /*!<   3  Hard Fault, all classes of Fault                                 */
  SVCall_IRQn                   =  -5,              /*!<  11  System Service Call via SVC instruction                          */
  PendSV_IRQn                   =  -2,              /*!<  14  Pendable request for system service                              */
  SysTick_IRQn                  =  -1,              /*!<  15  System Tick Timer                                                */
/* ---------------------  FM33L0XX Specific Interrupt Numbers  -------------------- */
  WWDT_IRQn                   	=  0,               /*!<   0    WWDT             */
  SVD_IRQn               				=  1,               /*!<   1    SVD_IRQn         */
  RTC_IRQn               				=  2,               /*!<   2    RTC_IRQn         */
  FLASH_IRQn                  	=  3,               /*!<   3    FLASH_IRQn       */ 
  LFDET_IRQn                 		=  4,               /*!<   4    LFDET_IRQn       */
  ADC_IRQn                  		=  5,               /*!<   5    ADC_IRQn         */
  NULL1			                    =  6,               /*!<   6    NULL             */
  SPI1_IRQn                     =  7,               /*!<   7    SPI1_IRQn        */
  SPI2_IRQn                     =  8,               /*!<   8    SPI2_IRQn        */
  LCD_IRQn                 	    =  9,               /*!<   9    LCD_IRQn        */
  UART0_IRQn                    =  10,           		/*!<  10   UART0_IRQn       */
  UART1_IRQn                    =  11,           		/*!<  11   UART1_IRQn       */
  UART4_IRQn                    =  12,           		/*!<  12   UART4_IRQn	      */
  UART5_IRQn                    =  13,              /*!<  13   UART5_IRQn       */ 
  HFDET_IRQn           			    =  14,              /*!<  14   HFDET_IRQn       */
	U7816_IRQn	            			=  15,              /*!<  15   U7816_IRQn       */
  LPUART1_IRQn            		  =  16,              /*!<  16   LPUART1_IRQn     */
  I2C_IRQn                      =  17,              /*!<  17   I2C_IRQn         */
	NULL3			                    =  18,           		/*!<  18   NULL             */
  AES_IRQn                      =  19,              /*!<  19   AES_IRQn         */ 
  LPTIM_IRQn                    =  20,              /*!<  20   LPTIM_IRQn			  */
	DMA_IRQn                 		  =  21,              /*!<  21   DMA_IRQn         */
  WKUP_IRQn		                  =  22,              /*!<  22   WKUP_IRQn        */
  OPA1_IRQn 		                =  23,              /*!<  23   OPA1_IRQn        */
  BSTIM_IRQn                    =  24,              /*!<  24   BSTIM_IRQn       */
  OPA2_IRQn   		              =  25,              /*!<  25   OPA2_IRQn        */
  GPTIM0_IRQn                   =  26,              /*!<  26   GTIM0_IRQn      */
  GPTIM1_IRQn                   =  27,              /*!<  27   GTIM1_IRQn      */
  ATIM_IRQn                     =  28,              /*!<  28   ATIM_IRQn        */
  VREF_IRQn						          =  29,              /*!<  29   VREF_IRQn	      */
  GPIO_IRQn                  		=  30,              /*!<  30   GPIO_IRQn        */
	LPUART0_IRQn               		=  31,              /*!<  31   LPUART0_IRQn 	  */
} IRQn_Type;


/** @addtogroup Configuration_of_CMSIS
  * @{
  */


/* ================================================================================ */
/* ================      Processor and Core Peripheral Section     ================ */
/* ================================================================================ */

/* ----------------Configuration of the Cortex-M0 Processor and Core Peripherals---------------- */
#define __CM0_REV                 0x0100            /*!< Cortex-M0 Core Revision                                               */
#define __MPU_PRESENT                  0            /*!< MPU present or not                                                    */
#define __VTOR_PRESENT            		 1						/*!< VTOR present or not 																									 */
#define __NVIC_PRIO_BITS               2            /*!< Number of Bits used for Priority Levels                               */
#define __Vendor_SysTickConfig         0            /*!< Set to 1 if different SysTick Config is used                          */
/** @} */ /* End of group Configuration_of_CMSIS */

