wyp19960729/FM33L0XX-keil-GCC-/keil project/FM33L0XX_CORE_FILE/Include/FM33L0XX.h
#include "core_cm0plus.h"                            /*!< Cortex-M0 processor and core peripherals                           */
#include "system_FM33L0XX.h"                        /*!< FM33L0XX System                                                        */

/* ================================================================================ */
/* ================       Device Specific Peripheral Section       ================ */
/* ================================================================================ */


/** @addtogroup Device_Peripheral_Registers
  * @{
  */


/* -------------------  Start of section using anonymous unions  ------------------ */
#if defined(__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined(__ICCARM__)
  #pragma language=extended
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__TMS470__)
/* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning 586
#else
  #warning Not supported compiler type
#endif

/* ================================================================================ */
/* ================                       DBG                      ================ */
/* ================================================================================ */
typedef struct
{
  __IO uint32_t REV;
  __IO uint32_t CR; 							    /*!<  Debug Configuration Register */
	__IO uint32_t HDFR;   							/*!<  HardFault Flag Register*/
  __IO uint32_t WKFR;  							  /*!<  Debug Wakeup Flag Register*/
	
}DBG_Type;


/* ================================================================================ */
/* ================                       PMU                      ================ */
/* ================================================================================ */
typedef struct
{
	__IO uint32_t CR; 							  		    /*!< Power Management Control Register  */
	__IO uint32_t WKTR;   								    /*!<  Wakeup Time Register*/
	__IO uint32_t WKFR;  								      /*!<  Wakeup Source Flags Register*/
  __IO uint32_t IER;									      /*!<  PMU Interrupt Enable Register*/
  __IO uint32_t ISR;									      /*!<  PMU Interrupt and Status Register*/
}PMU_Type;

typedef struct
{
	__IO uint32_t CR; 							  		    /*!< VREF Control Register  */
	__IO uint32_t SR;   								      /*!<  VREF Status Register*/
	__IO uint32_t IER;  								      /*!<  VREF Interrupt Enable Register*/
}PMU_VREF_Type;

typedef struct
{
	__IO uint32_t CR; 							  		    /*!< Buffer Control Register  */
}PMU_BUF_Type;

/* ================================================================================ */
/* ================                       UART                     ================ */
/* ================================================================================ */

typedef struct 
{
	__IO 	uint32_t	IRCR;								/*!< Infrared modulation Control Register */  		
	
} UART_COMMON_Type;
	 
typedef struct 
{
  __IO  uint32_t CSR;               /*!< UART Control Status Register */
  __IO 	uint32_t IER;               /*!< UART  Interrupt Enable Register */
  __IO 	uint32_t ISR;               /*!< UART Interrupt Status Register*/
  __IO 	uint32_t TODR;              /*!< UART Time-Out and Delay Register*/
  __IO 	uint32_t RXBUF;             /*!< UART  Receive Buffer */
	__IO 	uint32_t TXBUF;             /*!< UART Transmit Buffer */
	__IO 	uint32_t BGR;								/*!< UART Baud rate Generator Register */
												
} UART_Type; 

/* ================================================================================ */
/* ================                      RCC                  ================ */
/* ================================================================================ */
typedef struct
{
	__IO uint32_t LKP_CR;							/*!< Lockup reset Control Register			         ,Address offset: 0x00*/
	__IO uint32_t SOFTRST;						/*!< Software Reset Register		                 ,Address offset: 0x04*/
	__IO uint32_t RSTFR;							/*!<  Reset Flag Register				                 ,Address offset: 0x08*/
  __IO uint32_t SYSCLK_CR; 					/*!<  System Clock Control Register						   ,Address offset: 0x0C*/
  __IO uint32_t RCHF_CR;   					/*!<  RCHF Control Register			                 ,Address offset: 0x10*/
  __IO uint32_t RC4M_TR;  					/*!<  RC4M Trim Register					               ,Address offset: 0x14*/
  __IO uint32_t PLL_CR;  						/*!<  PLL Control Register				               ,Address offset: 0x18*/
	__IO uint32_t RCLP_CR;  					/*!<  RCLP CONFIG REGISTER 			                 ,Address offset: 0x1C*/
	__IO uint32_t RCLP_TR;  					/*!<  RCLP TRIM  REGISTER					               ,Address offset: 0x20*/
	__IO uint32_t XTLF_CR;  					/*!<  XTLF CONFIG REGISTER			                 ,Address offset: 0x24*/
	__IO uint32_t PCLK_CR1;  					/*!<  Peripheral bus Clock Control Register1 		 ,Address offset: 0x28*/
	__IO uint32_t PCLK_CR2;  					/*!<  Peripheral bus Clock Control Register2 		 ,Address offset: 0x2C*/
	__IO uint32_t PCLK_CR3;  					/*!<  Peripheral bus Clock Control Register3 		 ,Address offset: 0x30*/
	__IO uint32_t PCLK_CR4;  					/*!<  Peripheral bus Clock Control Register4 		 ,Address offset: 0x34*/
	__IO uint32_t REV0;								/*!<  RESERVED REGISTER 0	 			                 ,Address offset: 0x38*/
	__IO uint32_t REV1;								/*!<  RESERVED REGISTER 1	 			                 ,Address offset: 0x3C*/
	__IO uint32_t REV2;								/*!<  RESERVED REGISTER 2	 			                 ,Address offset: 0x40*/
	__IO uint32_t AHBM_CR;  					/*!<  AHB Master Control Register                ,Address offset: 0x44*/
	__IO uint32_t REV3;  							/*!<  RESERVED REGISTER 3		                     ,Address offset: 0x48*/
	__IO uint32_t REV4;  							/*!<  RESERVED REGISTER 4		                     ,Address offset: 0x4C*/
	__IO uint32_t PRST_EN;   	        /*!<  Peripheral Reset Enable Register           ,Address offset: 0x50*/
  __IO uint32_t AHBRST_CR;   		    /*!<  AHB Peripherals Reset Control Register     ,Address offset: 0x54*/
  __IO uint32_t APBRST_CR1;  		    /*!<  APB Peripherals Reset Control Register1    ,Address offset: 0x58*/
	__IO uint32_t APBRST_CR2;  		    /*!<  APB Peripherals Reset Control Register2    ,Address offset: 0x5C*/
	__IO uint32_t XTHF_CR; 						/*!<  XTHF Control Register			                 ,Address offset: 0x60*/
	__IO uint32_t RC4M_CR; 					  /*!<  RC4M Control Register			                 ,Address offset: 0x64*/
	__IO uint32_t RCHF_TR; 						/*!<  RCHF Trim Register                         ,Address offset: 0x68*/	
	__IO uint32_t OPC_CR1; 						/*!<  Peripheral Operation Clock Control Register1	,Address offset: 0x6C*/	
	__IO uint32_t OPC_CR2; 						/*!<  Peripheral Operation Clock Control Register2  ,Address offset: 0x70*/
	
}RCC_Type;

typedef struct
{
  __IO uint32_t IER;						/*!< XTLF Oscillation Fail Detection Interrupt Enable Register,	        Address offset: 0x00 */
  __IO uint32_t ISR;						/*!< XTLF Oscillation Fail Detection Interrupt Status Register,		      Address offset: 0x04 */

