wyp19960729/FM33L0XX-keil-GCC-/keil project/FM33L0XX_CORE_FILE/Include/FM33L0XX.h
}RCC_FDET_Type;
typedef struct
{
  __IO uint32_t CR;						/*!< PDR Control Register,	        Address offset: 0x00 */

}RCC_PDR_Type;

typedef struct
{
  __IO uint32_t CR;						/*!< BOR Control Register,	        Address offset: 0x00 */

}RCC_BOR_Type;

/* ================================================================================ */
/* ================                       DMA                      ================ */
/* ================================================================================ */
typedef struct
{
  __IO uint32_t GCR; 						/*!<  DMA Global Control Register 		    ,Address offset: 0x00*/
  __IO uint32_t CH0_CR;   			/*!<  Channel 0 Control Register		      ,Address offset: 0x04*/
  __IO uint32_t CH0_MAD;  			/*!<  Channel 0 Memory Address Register 	,Address offset: 0x08*/
  __IO uint32_t CH1_CR;  				/*!<  Channel 1 Control Register          ,Address offset: 0x0C*/
	__IO uint32_t CH1_MAD;  			/*!<  Channel 1 Memory Address Register   ,Address offset: 0x10*/	
	__IO uint32_t CH2_CR;  				/*!<  Channel 2 Control Register          ,Address offset: 0x14*/
	__IO uint32_t CH2_MAD;  			/*!<  Channel 2 Memory Address Register   ,Address offset: 0x18*/
	__IO uint32_t CH3_CR;  				/*!<  Channel 3 Control Register          ,Address offset: 0x1C*/
	__IO uint32_t CH3_MAD;  			/*!<  Channel 3 Memory Address Register   ,Address offset: 0x20*/
	__IO uint32_t CH4_CR;  				/*!<  Channel 4 Control Register          ,Address offset: 0x24*/
	__IO uint32_t CH4_MAD;  			/*!<  Channel 4 Memory Address Register   ,Address offset: 0x28*/
	__IO uint32_t CH5_CR;  				/*!<  Channel 5 Control Register          ,Address offset: 0x2C*/
	__IO uint32_t CH5_MAD;  			/*!<  Channel 5 Memory Address Register   ,Address offset: 0x30*/
	__IO uint32_t CH6_CR;  				/*!<  Channel 6 Control Register          ,Address offset: 0x34*/
	__IO uint32_t CH6_MAD;  			/*!<  Channel 6 Memory Address Register   ,Address offset: 0x38*/
	__IO uint32_t CH7_CR;  				/*!<  Channel 7 Control Register          ,Address offset: 0x3C*/
	__IO uint32_t CH7_FLSAD;  		/*!<  Channel 7 Flash Address Register    ,Address offset: 0x40*/
	__IO uint32_t CH7_RAMAD;  		/*!<  Channel 7 RAM Address Register      ,Address offset: 0x44*/
	__IO uint32_t ISR;  					/*!<  DMA Interrupt Status Register       ,Address offset: 0x48*/
  
}DMA_Type;


/* ================================================================================ */
/* ================                        SPI                     ================ */
/* ================================================================================ */
typedef struct
{
  __IO uint32_t CR1; 								/*!<  SPI1 Control Register1 */
  __IO uint32_t CR2;   							/*!<  SPI1 Control Register2 */
  __IO uint32_t CR3;  							/*!<  SPI1 Control Register3 */
  __IO uint32_t IER;  		  				/*!< SPI1 Interrupt Enable Register */
	__IO uint32_t ISR;  							/*!<  SPI1 Status Register */	
	__IO uint32_t TXBUF;  						/*!<  SPI1 Transmit Buffer */
	__IO uint32_t RXBUF;  						/*!<  SPI1 Receive Buffer */
  
}SPI_Type;


/* ================================================================================ */
/* ================                       GPIO                     ================ */
/* ================================================================================ */
typedef struct
{
  __IO uint32_t INEN; 									/*!<  Input Enable Register*/
  __IO uint32_t PUEN;   								/*!<  Pull-Up Enable Register*/
  __IO uint32_t ODEN;  									/*!<  Open-Drain Enable Register*/
  __IO uint32_t FCR;  									/*!<  Function Control Register*/
	__IO uint32_t DO;  									  /*!<  Data Output Register  */	
	__O uint32_t  DSET;  									/*!<  Data Set Register  */
	__O uint32_t  DRST;  								  /*!<  Data Reset Register */
	__I uint32_t  DIN;  									/*!<  Data Input RegisterR */
	__IO uint32_t DFS;							 		  /*!<  Digital Function Select*/
	__IO uint32_t HD;										  /*!<  High Driver Enable Register*/
  __IO uint32_t ANEN;                   /*!<  Analog channel Enable Register*/
  
}GPIO_Type;

typedef struct
{
  __IO uint32_t EXTI_SEL; 						  	/*!<  External Interrupt input Select Register			 */
  __IO uint32_t EXTI_EDS;   						  /*!<  External Interrupt Edge Select and Enable Register	 */
  __IO uint32_t EXTI_DF;  							  /*!<  External Interrupt Digital Filter Register	 */
  __IO uint32_t EXTI_ISR;  							  /*!<  External Interrupt and Status Register			 */
	__IO uint32_t EXTI_DI;  						/*!<  External Interrupt Data Input Register		 */	
  __IO uint32_t RSV0[59];                 /*!<  RESERVED REGISTER 	     */
  __IO uint32_t FOUT_SEL;                 /*!<  Frequency Output Select Register	   */
  __IO uint32_t RSV1[63];                 /*!<  RESERVED REGISTER 	 	   */
  __IO uint32_t PINWKEN;                  /*!<  Wakeup Enable Register */
}GPIO_COMMON_Type;


/* ================================================================================ */
/* ================                       IWDG                     ================ */
/* ================================================================================ */
typedef struct
{
  __IO uint32_t SERV;   	/*!< IWDT Service Register,          Address offset: 0x00 */
  __IO uint32_t CR;   		/*!< IWDT Config Register, 		       Address offset: 0x04 */
  __I uint32_t 	CNT;  		/*!< IWDT Counter Register,          Address offset: 0x08 */
  __IO uint32_t WIN;	    /*!< IWDT Window Register,           Address offset: 0x0C */
  __IO uint32_t SR;	      /*!< IWDT Status Register,           Address offset: 0x10 */
} IWDT_Type;


/* ================================================================================ */
/* ================                      FLASH                     ================ */
/* ================================================================================ */
typedef struct
{
  __IO uint32_t RDCR;        /*!< Flash Read Control Register,              Address offset: 0x00 */
  __IO uint32_t REV;   		   /*!< RESERVED REGISTER,		                    Address offset: 0x04 */
  __I uint32_t 	OPTBR;  		 /*!< Flash Option Bytes Register,              Address offset: 0x08 */
	__IO uint32_t ACLOCK;		   /*!< Flash Application Code Lock Register,     Address offset: 0x0C */
	__IO uint32_t RSV0;				 /*!< RESERVED REGISTER,                        Address offset: 0x10 */
	__IO uint32_t EPCR;			   /*!< Flash Erase/Program Control Register,     Address offset: 0x14 */
	__IO uint32_t KEY;			   /*!< Flash Key Register,                       Address offset: 0x18 */
	__IO uint32_t IER;			   /*!< Flash Interrupt Enable Register,          Address offset: 0x1C */
	__IO uint32_t ISR;			   /*!< Flash Interrupt Status Register,          Address offset: 0x20 */	
    
