wyp19960729/FM33L0XX-keil-GCC-/keil project/FM33L0XX_CORE_FILE/Include/FM33L0XX.h
} FLS_Type;

/* ================================================================================ */
/* ================                     ATIM                       ================ */
/* ================================================================================ */
typedef struct
{
  __IO uint32_t CR1;   				/*!< ATIM Control Register1,       	            Address offset: 0x00 */
  __IO uint32_t CR2;          /*!< ATIM Control Register2,       	            Address offset: 0x04 */
  __IO uint32_t SMCR;         /*!< ATIM Slave Mode Control Register,          Address offset: 0x08 */
  __IO uint32_t DIER;         /*!< ATIM DMA and Interrupt Enable Register,    Address offset: 0x0C */
  __IO uint32_t ISR;          /*!< ATIM Interrupt Status Register,       	    Address offset: 0x10 */
  __IO uint32_t EGR;          /*!< ATIM Event Generation Register,            Address offset: 0x14 */
  __IO uint32_t CCMR1;        /*!< ATIM Capture/Compare Mode Register1,       Address offset: 0x18 */
  __IO uint32_t CCMR2;        /*!< ATIM Capture/Compare Mode Register2,       Address offset: 0x1C */
  __IO uint32_t CCER;         /*!< ATIM Capture/Compare Enable Register,      Address offset: 0x20 */
  __IO uint32_t CNT;          /*!< ATIM Counter Register,       	            Address offset: 0x24 */
  __IO uint32_t PSC;          /*!< ATIM Prescaler Register,       	          Address offset: 0x28 */
  __IO uint32_t ARR;          /*!< ATIM Auto-Reload Register,       	        Address offset: 0x2C */
  __IO uint32_t RCR;          /*!< ATIM Repetition Counter Register,          Address offset: 0x30 */
  __IO uint32_t CCR1;         /*!< ATIM Capture/Compare Register1,       	    Address offset: 0x34 */
  __IO uint32_t CCR2;         /*!< ATIM Capture/Compare Register2,       	    Address offset: 0x38 */
  __IO uint32_t CCR3;         /*!< ATIM Capture/Compare Register3,       	    Address offset: 0x3C */
  __IO uint32_t CCR4;         /*!< ATIM Capture/Compare Register4,       	    Address offset: 0x40 */
  __IO uint32_t BDTR;         /*!< ATIM Break and Deadtime Register,       	  Address offset: 0x44 */
  __IO uint32_t DCR;          /*!< ATIM DMA Control Register,       	        Address offset: 0x48 */
  __IO uint32_t DMAR;         /*!< ATIM DMA Access Register,       	          Address offset: 0x4C */
  __IO uint32_t RSV0;         /*!< RESERVED REGISTER0,       	                Address offset: 0x50 */
  __IO uint32_t RSV1;         /*!< RESERVED REGISTER1,        	              Address offset: 0x54 */
  __IO uint32_t RSV2;         /*!< RESERVED REGISTER2,       	                Address offset: 0x58 */
  __IO uint32_t RSV3;         /*!< RESERVED REGISTER3,       	                Address offset: 0x5C */
  __IO uint32_t BKCR;         /*!< ATIM Break Control Register,       	      Address offset: 0x60 */
  
} ATIM_Type;

/* ================================================================================ */
/* ================                     GPTIM                      ================ */
/* ================================================================================ */
typedef struct
{
  __IO uint32_t CR1;   				 /*!< GPTIM Control Register1,       	            Address offset: 0x00 */
  __IO uint32_t CR2;           /*!< GPTIM Control Register2,       	            Address offset: 0x04 */
  __IO uint32_t SMCR;          /*!< GPTIM Slave Mode Control Register,          Address offset: 0x08 */
  __IO uint32_t DIER;          /*!< GPTIM DMA and Interrupt Enable Register,    Address offset: 0x0C */
  __IO uint32_t ISR;           /*!< GPTIM Interrupt Status Register,       	    Address offset: 0x10 */
  __IO uint32_t EGR;           /*!< GPTIM EVENT GENERATE REGISTER,              Address offset: 0x14 */
  __IO uint32_t CCMR1;         /*!< GPTIM Capture/Compare Mode Register1,       Address offset: 0x18 */
  __IO uint32_t CCMR2;         /*!< GPTIM Capture/Compare Mode Register2,       Address offset: 0x1C */
  __IO uint32_t CCER;          /*!< GPTIM Capture/Compare Enable Register,      Address offset: 0x20 */
  __IO uint32_t CNT;           /*!< GPTIM Counter Register,       	            Address offset: 0x24 */
  __IO uint32_t PSC;           /*!< GPTIM Prescaler Register,       	          Address offset: 0x28 */
  __IO uint32_t ARR;           /*!< GPTIM Auto-Reload Register,       	        Address offset: 0x2C */
  __IO uint32_t RSV0;          /*!< RESERVED REGISTER0,       	                Address offset: 0x30 */
  __IO uint32_t CCR1;          /*!< GPTIM Capture/Compare Register1,       	    Address offset: 0x34 */
  __IO uint32_t CCR2;          /*!< GPTIM Capture/Compare Register2,       	    Address offset: 0x38 */
  __IO uint32_t CCR3;          /*!< GPTIM Capture/Compare Register3,       	    Address offset: 0x3C */
  __IO uint32_t CCR4;          /*!< GPTIM Capture/Compare Register4,       	    Address offset: 0x40 */
  __IO uint32_t RSV1;          /*!< RESERVED REGISTER1,       	                Address offset: 0x44 */
  __IO uint32_t DCR;           /*!< GPTIM DMA CONTROL REGISTER,       	        Address offset: 0x48 */
  __IO uint32_t DMAR;          /*!< GPTIM DMA access Register,       	          Address offset: 0x4C */
  __IO uint32_t RSV2;          /*!< RESERVED REGISTER2,       	                Address offset: 0x50 */
  __IO uint32_t RSV3;          /*!< RESERVED REGISTER3,       	                Address offset: 0x54 */
  __IO uint32_t RSV4;          /*!< RESERVED REGISTER4,       	                Address offset: 0x58 */
  __IO uint32_t RSV5;          /*!< RESERVED REGISTER5,       	                Address offset: 0x5C */
  __IO uint32_t ITRSEL;        /*!< GPTIM  Internal Trigger Select Register,    Address offset: 0x60 */
} GPTIM_Type;

/* ================================================================================ */
/* ================                      BSTIM                     ================ */
/* ================================================================================ */
typedef struct
{
  __IO uint32_t CR1;   				 /*!< BSTIM Control Register1,       	          Address offset: 0x00 */
  __IO uint32_t CR2;	         /*!< BSTIM Control Register2,       	          Address offset: 0x04 */
  __IO uint32_t RSV0;	         /*!< RESERVED REGISTER0,       	              Address offset: 0x08 */
  __IO uint32_t IER;           /*!< BSTIM Interrupt Enable Register,          Address offset: 0x0C */
  __IO uint32_t ISR;           /*!< BSTIM Interrupt Status Register,       	  Address offset: 0x10 */
  __IO uint32_t EGR;           /*!< BSTIM Event Generation Register,          Address offset: 0x14 */
  __IO uint32_t RSV1;          /*!< RESERVED REGISTER1,       	              Address offset: 0x18 */
  __IO uint32_t RSV2;          /*!< RESERVED REGISTER2,       	              Address offset: 0x1C */
  __IO uint32_t RSV3;          /*!< RESERVED REGISTER3,       	              Address offset: 0x20 */
  __IO uint32_t CNT;           /*!< BSTIM Counter Register,       	          Address offset: 0x24 */
  __IO uint32_t PSC;           /*!< BSTIM Prescaler Register,       	        Address offset: 0x28 */
  __IO uint32_t ARR;           /*!< BSTIM Auto-Reload Register,       	      Address offset: 0x2C */
} BSTIM_Type;

/* ================================================================================ */
/* ================                      I2C                       ================ */
/* ================================================================================ */
typedef struct
{
  __IO uint32_t MSP_CFGR;   			/*!< I2C Master Config Register,       			   Address offset: 0x00 */
  __IO uint32_t MSP_CR;   				/*!< I2C Master Control Register, 					   Address offset: 0x04 */
  __IO uint32_t MSP_IER;  				/*!< I2C Master Intterupt Enable Register,	   Address offset: 0x08 */
	__IO uint32_t MSP_ISR;					/*!< I2C Master Interrupt Status Register,     Address offset: 0x0C */
	__IO uint32_t MSP_SR;						/*!< I2C Master Status Register,			  		   Address offset: 0x10 */
	__IO uint32_t MSP_BGR;					/*!< I2C Master Baud rate Generator Register,	 Address offset: 0x14 */
	__IO uint32_t MSP_BUF;					/*!< I2C Master transfer Buffer,			    		 Address offset: 0x18 */
	__IO uint32_t MSP_TCR;				  /*!< I2C Master Timing Control Register,		   Address offset: 0x1C */	
	__IO uint32_t MSP_TOR;					/*!< I2C Master Time-Out Register,	           Address offset: 0x20 */	
	__IO uint32_t SSP_CR;						/*!< I2C Slave Control Register,						   Address offset: 0x24 */		
	__IO uint32_t SSP_IER;					/*!< I2C Slave Interrupt Enable Register,		   Address offset: 0x28 */		
	__IO uint32_t SSP_ISR;					/*!< I2C Slave Interrupt Status Register,			 Address offset: 0x2C */		
	__IO uint32_t SSP_SR;						/*!< I2C Slave Status Register,							   Address offset: 0x30 */	
	__IO uint32_t SSP_BUF;					/*!< I2C Slave transfer Buffer,							   Address offset: 0x34 */
	__IO uint32_t SSP_ADR;					/*!< I2C Slave Address Register,						   Address offset: 0x38 */		
  
} I2C_Type;

	
/* ================================================================================ */
/* ================                      SVD                      ================ */
/* ================================================================================ */
typedef struct
{
  __IO uint32_t CFGR;						/*!< SVD Config Register,	 					           Address offset: 0x24 */
	__IO uint32_t CR;						  /*!< SVD Control Register,			 			         Address offset: 0x28 */
	__IO uint32_t IER;						/*!< SVD Interrupt Enable Register,		         Address offset: 0x2C */
  __IO uint32_t ISR;	          /*!< SVD Interrupt Status Register,	           Address offset: 0x30 */
  __IO uint32_t VSR;	          /*!< SVD reference Voltage Select Register,		 Address offset: 0x34 */
} SVD_Type;

/* ================================================================================ */
/* ================                      OPA                      ================ */
/* ================================================================================ */
typedef struct
{
  __IO uint32_t CR;						  /*!< OPA Control Register 				   */
	__IO uint32_t CALR;						/*!< OPA Calibration Register			   */
	__IO uint32_t IER;						/*!< OPA Interrupt Enable Register   */
  __IO uint32_t ISR;	          /*!< OPA Interrupt Status Register   */
} OPA_Type;

/* ================================================================================ */
/* ================                     ADC                        ================ */
/* ================================================================================ */
typedef struct
{
  __IO uint32_t ISR;   				 /*!< ADC Interrupt and Status Register,       Address offset: 0x00 */
  __IO uint32_t IER;           /*!< ADC Interrupt Enable Register,       		 Address offset: 0x04 */
  __IO uint32_t CR;            /*!< ADC Control Register,       			       Address offset: 0x08 */
  __IO uint32_t CFGR;          /*!< ADC Config Register,       			         Address offset: 0x0C */
  __IO uint32_t SMTR;          /*!< ADC Sampling Time Register,       			 Address offset: 0x10 */
  __IO uint32_t CHER;          /*!< ADC Channel Enable Register,       			 Address offset: 0x14 */
  __IO uint32_t DR;            /*!< ADC Data Register,       			           Address offset: 0x18 */
  __IO uint32_t CAL;           /*!< ADC Calibration Register,       			    Address offset: 0x1C */
  __IO uint32_t HLTR;          /*!< ADC analog watchdog Threshold Register,   Address offset: 0x20 */
} ADC_Type;

/* ================================================================================ */
/* ================                      CRC                       ================ */
/* ================================================================================ */
typedef struct
{
  __IO uint32_t DR;   					 /*!< CRC Data Register,       					    Address offset: 0x00 */
  __IO uint32_t CR;   				   /*!< CRC Control Register, 			          Address offset: 0x04 */
  __IO uint32_t LFSR;  				   /*!< CRC Linear Feedback Shift Register,  	Address offset: 0x08 */
	__IO uint32_t XOR;					   /*!< CRC output XOR Register,      				Address offset: 0x0C */
	__IO uint32_t FLS_CR;					 /*!< CRC Flash checksum Control Register,	Address offset: 0x10 */
	__IO uint32_t FLS_AD;					 /*!< CRC Flash checksum Address Register,	Address offset: 0x14 */
	__IO uint32_t FLS_SIZE;				 /*!< CRC Flash checksum Size Register,			Address offset: 0x18 */
	__IO uint32_t POLY;					   /*!< CRC Polynominal Register,					    Address offset: 0x1C */
  
