wyp19960729/FM33L0XX-keil-GCC-/keil project/FM33L0XX_CORE_FILE/Include/FM33L0XX.h
} CRC_Type;

/* ================================================================================ */
/* ================                      U7816                     ================ */
/* ================================================================================ */
typedef struct
{
  __IO uint32_t CR;   					/*!< U7816 Control Register,              Address offset: 0x00 */
  __IO uint32_t FFR;            /*!< U7816 Frame Format Register,         Address offset: 0x04 */
  __IO uint32_t EGTR;           /*!< U7816 Extra Guard Time Register,     Address offset: 0x08 */
  __IO uint32_t PSC;            /*!< U7816 Prescaler Register,            Address offset: 0x0C */
  __IO uint32_t BGR;            /*!< U7816 Baud rate Generator Register,  Address offset: 0x10 */
  __IO uint32_t RXBUF;          /*!< U7816 Receive Buffer,                Address offset: 0x14 */
  __IO uint32_t TXBUF;          /*!< U7816 Transmit Buffer,               Address offset: 0x18 */
  __IO uint32_t IER;            /*!< U7816 Interrupt Enable Register,     Address offset: 0x1C */
  __IO uint32_t ISR;            /*!< U7816 Interrupt Status Register,     Address offset: 0x20 */
  
} U7816_Type;

/* ================================================================================ */
/* ================                      LPTIM                     ================ */
/* ================================================================================ */
typedef struct
{
  __IO uint32_t CFGR;   					  /*!< LPTIM Config Register,   	                         Address offset: 0x00*/
  __IO uint32_t CNT;   					    /*!< LPTIM Counter Register, 	                           Address offset: 0x04*/
  __IO uint32_t CCSR;  				      /*!< LPTIM Capture/Compare Control and Status Register,  Address offset: 0x08*/
	__IO uint32_t ARR;					      /*!< LPTIM Auto-Reload Register,                         Address offset: 0x0C*/
	__IO uint32_t IER;					      /*!< LPTIM Interrupt Enable Register,                    Address offset: 0x10*/
	__IO uint32_t ISR;					      /*!< LPTIM Interrupt Status Register,	 		 	             Address offset: 0x14*/
	__IO uint32_t CR;				          /*!< LPTIM Control Register,			                       Address offset: 0x18*/	
  __IO uint32_t RSV;                /*!< RESERVED REGISTER,                                  Address offset: 0x1C*/
  __IO uint32_t CCR1;               /*!< LPTIM Capture/Compare Register1,   	               Address offset: 0x20*/
  __IO uint32_t CCR2;               /*!< LPTIM Capture/Compare Register2,   	               Address offset: 0x24*/
  
} LPTIM_Type;

/* ================================================================================ */
/* ================                      BEEP                      ================ */
/* ================================================================================ */
typedef struct
{
  __IO uint32_t CSR;   					  /*!< BEEP Control Status Register,   	Address offset: 0x00*/
  
} BEEP_Type;

/* ================================================================================ */
/* ================                      LPUART                    ================ */
/* ================================================================================ */
typedef struct
{
  __IO uint32_t CSR;   					 /*!< LPUART Control Status Register,   	      Address offset: 0x00*/
  __IO uint32_t IER;   					 /*!< LPUART Interrupt Enable Register, 	      Address offset: 0x04*/
  __IO uint32_t ISR;  				   /*!< LPUART Interrupt Status Register,  	      Address offset: 0x08*/
	__IO uint32_t BMR;					   /*!< LPUART Baud rate Modulation Register,     Address offset: 0x0C*/
	__IO uint32_t RXBUF;					 /*!< LPUART Receive Buffer Register,           Address offset: 0x10*/
	__IO uint32_t TXBUF;					 /*!< LPUART Transmit Buffer Register,	 		 	  Address offset: 0x14*/
	__IO uint32_t DMR;				     /*!< LPUART  data Matching Register,			      Address offset: 0x18*/	
  
} LPUART_Type;

/* ================================================================================ */
/* ================                      LCD                     ================ */
/* ================================================================================ */
typedef struct
{
  __IO uint32_t CR;   			      /*!< LCD Control Register,    					Address offset: 0x00 */
  __IO uint32_t TEST;   				  /*!< LCD test Register, 				        Address offset: 0x04 */
  __IO uint32_t FCR;  					  /*!< LCD Frequency Control Register,    Address offset: 0x08 */
	__IO uint32_t FLKT;						  /*!< LCD Flick Time Register,      		  Address offset: 0x0C */  
	__IO uint32_t REV1;							/*!< NULL,															Address offset: 0x10 */
	__IO uint32_t IER;						  /*!< LCD Interrupt Enable Register,	 	  Address offset: 0x14 */
	__IO uint32_t ISR;						  /*!< LCD Interrupt Status Register,			Address offset: 0x18 */
	__IO uint32_t REV2;						  /*!< NULL,                							Address offset: 0x1C */	
	__IO uint32_t REV3;						  /*!< NULL,															Address offset: 0x20 */	
	__IO uint32_t DATA0;				    /*!< LCD data buffer registers 0,				Address offset: 0x24 */	
	__IO uint32_t DATA1;				    /*!< LCD data buffer registers 1,				Address offset: 0x28 */
	__IO uint32_t DATA2;				    /*!< LCD data buffer registers 2,				Address offset: 0x2C */
	__IO uint32_t DATA3;				    /*!< LCD data buffer registers 3,			  Address offset: 0x30 */
	__IO uint32_t DATA4;				    /*!< LCD data buffer registers 4,				Address offset: 0x34 */
	__IO uint32_t DATA5;				    /*!< LCD data buffer registers 5,				Address offset: 0x38 */
	__IO uint32_t DATA6;				    /*!< LCD data buffer registers 6,			  Address offset: 0x3C */
	__IO uint32_t DATA7;				    /*!< LCD data buffer registers 7,				Address offset: 0x40 */
	__IO uint32_t REV4;				      /*!< NULL,															Address offset: 0x44 */
	__IO uint32_t REV5;				      /*!< NULL,															Address offset: 0x48 */
	__IO uint32_t REV6;					    /*!< NULL,															Address offset: 0x4C */
	__IO uint32_t COM_EN;						/*!< LCD COM Enable Register,					  Address offset: 0x50 */
	__IO uint32_t SEG_EN0;					/*!< LCD SEG Enable Register0,					Address offset: 0x54 */
	
} LCD_Type;

/* ================================================================================ */
/* ================                      RTC                       ================ */
/* ================================================================================ */
typedef struct
{
  __IO uint32_t WER;   					/*!< RTC Write Enable Register,    		Address offset: 0x00 */
  __IO uint32_t IER;   					/*!< RTC Interrupt Enable Register, 	Address offset: 0x04 */
  __IO uint32_t ISR;  					/*!< RTC Interrupt Status Register,  	Address offset: 0x08 */
	__IO uint32_t BCDSEC;					/*!< RTC SECOND IN BCD REGISTER,      Address offset: 0x0C */
	__IO uint32_t BCDMIN;					/*!< RTC MINITE IN BCD REGISTER,			Address offset: 0x10 */
	__IO uint32_t BCDHOUR;				/*!< RTC HOUR IN BCD REGISTER,	 			Address offset: 0x14 */
	__IO uint32_t BCDDAY;					/*!< RTC DAY IN BCD REGISTER,					Address offset: 0x18 */
	__IO uint32_t BCDWEEK;				/*!< RTC WEEK IN BCD REGISTER,				Address offset: 0x1C */	
	__IO uint32_t BCDMONTH;				/*!< RTC MONTH IN BCD REGISTER,				Address offset: 0x20 */	
	__IO uint32_t BCDYEAR;				/*!< RTC YEAR IN BCD REGISTER,				Address offset: 0x24 */	
	__IO uint32_t ALARM;					/*!< RTC Alarm Register,				      Address offset: 0x28 */
	__IO uint32_t TMSEL;					/*!< RTC Time Mark Select,				    Address offset: 0x2C */
	__IO uint32_t ADJUST;					/*!< RTC time Adjust Register,				Address offset: 0x30 */
	__IO uint32_t ADSIGN;					/*!< RTC time Adjust Sign Register,		Address offset: 0x34 */
	__IO uint32_t REV1;					  /*!< NULL,			 											Address offset: 0x38 */
	__IO uint32_t SBSCNT;					/*!< RTC Sub-Second Counter,					Address offset: 0x3C */
  __IO uint32_t RSV[12];        /*!< NULL,			 											Address offset: 0x40 */
  __IO uint32_t BKR0;           /*!< RTC BACKUP REGISTER0,						Address offset: 0x70 */
  __IO uint32_t BKR1;           /*!< RTC BACKUP REGISTER1,						Address offset: 0x74 */
  __IO uint32_t BKR2;           /*!< RTC BACKUP REGISTER2,						Address offset: 0x78 */
  __IO uint32_t BKR3;           /*!< RTC BACKUP REGISTER3,						Address offset: 0x7C */
  __IO uint32_t BKR4;           /*!< RTC BACKUP REGISTER4,						Address offset: 0x80 */
  __IO uint32_t BKR5;           /*!< RTC BACKUP REGISTER5,						Address offset: 0x84 */
  __IO uint32_t BKR6;           /*!< RTC BACKUP REGISTER6,						Address offset: 0x88 */
  __IO uint32_t BKR7;           /*!< RTC BACKUP REGISTER7,						Address offset: 0x8C */
  
} RTC_Type;

/* ================================================================================ */
/* ================                      AES                       ================ */
/* ================================================================================ */
typedef struct
{
  __IO uint32_t CR;   					/*!< AES Control Register,    					Address offset: 0x00 */
  __IO uint32_t IER;            /*!< AES Interrupt Enable Register,    	Address offset: 0x04 */
  __IO uint32_t ISR;   					/*!< AES Interrupt Status Register, 		Address offset: 0x08 */
  __IO uint32_t DIR;  					/*!< AES Data Input Register,  					Address offset: 0x0C */
	__IO uint32_t DOR;					  /*!< AES Data Output Register,      		Address offset: 0x10 */
	__IO uint32_t KEY0;					  /*!< AES Key Register 0,				        Address offset: 0x14 */
	__IO uint32_t KEY1;					  /*!< AES Key Register 1,	 							Address offset: 0x18 */
	__IO uint32_t KEY2;					  /*!< AES Key Register 2,								Address offset: 0x1C */
	__IO uint32_t KEY3;					  /*!< AES Key Register 3,								Address offset: 0x20 */	
	__IO uint32_t KEY4;					  /*!< AES Key Register 4,								Address offset: 0x24 */	
	__IO uint32_t KEY5;					  /*!< AES Key Register 5,								Address offset: 0x28 */	
	__IO uint32_t KEY6;					  /*!< AES Key Register 6,								Address offset: 0x2C */
	__IO uint32_t KEY7;					  /*!< AES Key Register 7,								Address offset: 0x30 */
	__IO uint32_t IVR0;					  /*!< AES Initial Vector Register 0,			Address offset: 0x34 */
	__IO uint32_t IVR1;					  /*!< AES Initial Vector Register 1,			Address offset: 0x38 */
	__IO uint32_t IVR2;					  /*!< AES Initial Vector Register 2,			Address offset: 0x3C */
	__IO uint32_t IVR3;					  /*!< AES Initial Vector Register 3,			Address offset: 0x40 */
  
} AES_Type;

/* ================================================================================ */
/* ================                      WWDT                      ================ */
/* ================================================================================ */
typedef struct
{
  __IO uint32_t CR;   				/*!< WWDT Control Register,    						Address offset: 0x00 */
  __IO uint32_t CFGR;   			/*!< WWDT Config Register, 								Address offset: 0x04 */
  __IO uint32_t CNT;  				/*!< WWDT Counter Register,  							Address offset: 0x08 */
	__IO uint32_t IER;					/*!<WWDT Interrupt Enable Register,       Address offset: 0x0C */
	__IO uint32_t ISR;					/*!< WWDT Interrupt Status Register,			Address offset: 0x10 */
	__IO uint32_t PSC;					/*!< WWDT Prescaler Register,             Address offset: 0x14 */	
  
} WWDT_Type;

/* ================================================================================ */
/* ================                      RNG                      ================ */
/* ================================================================================ */
typedef struct
{
__IO uint32_t CR;          /*!< RNG CONTROL REGISTER,    					 */
} RNG_CR_Type;

typedef struct
{
  __IO uint32_t RSV0;   				  /*!< RESERVED REGISTER,    				        Address offset: 0x00 */
  __IO uint32_t DOR;   				/*!< RNG OUTPUT REGISTER, 								Address offset: 0x04 */
  __IO uint32_t RSV1;  				    /*!< RESERVED REGISTER,  				          Address offset: 0x08 */
  __IO uint32_t RSV2;             /*!< RESERVED REGISTER,  				          Address offset: 0x0C */
	__IO uint32_t SR;						/*!< RNG FLAG REGISTER,                  Address offset: 0x10 */	
	__IO uint32_t CRC_CR;						/*!< RNG CRC CONTROL REGISTER,						Address offset: 0x14 */	
	__IO uint32_t CRC_DIR;						/*!< RNG CRC INPUT REGISTER,							Address offset: 0x18 */	
	__IO uint32_t CRC_SR;						/*!< RNG CRC FLAG REGISTER,							Address offset: 0x1C */		
} RNG_Type;

/* --------------------  End of section using anonymous unions  ------------------- */
#if defined(__CC_ARM)
  #pragma pop
#elif defined(__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning restore
#else
  #warning Not supported compiler type
#endif

/* ================================================================================ */
/* ================              CPU memory map                    ================ */
/* ================================================================================ */

/* Peripheral and SRAM base address */

