wyp19960729/FM33L0XX-keil-GCC-/keil project/FM33L0XX_CORE_FILE/Include/FM33L0XX.h
#define FLASH_BASE            ((     uint32_t)0x00000000)
#define SRAM_BASE             ((     uint32_t)0x20000000)
#define PERIPH_BASE           ((     uint32_t)0x40000000)

/* ================================================================================ */
/* ================              Peripheral memory map             ================ */
/* ================================================================================ */

/* Peripheral memory map */

#define DBG_BASE						(PERIPH_BASE				+0x00000000)
#define PMU_BASE				    (PERIPH_BASE				+0x00000100)
#define RCC_BASE				    (PERIPH_BASE				+0x00000200)
#define DMA_BASE						(PERIPH_BASE				+0x00000400)
#define GPIOA_BASE  				(PERIPH_BASE				+0x00000C00)
#define GPIOB_BASE					(PERIPH_BASE				+0x00000C40)
#define GPIOC_BASE					(PERIPH_BASE				+0x00000C80)
#define GPIOD_BASE  				(PERIPH_BASE				+0x00000CC0)
#define GPIO_COMMON_BASE		(PERIPH_BASE				+0x00000D00)
#define FLS_BASE					  (PERIPH_BASE				+0x00001000)
#define CRC_BASE						(PERIPH_BASE				+0x00010000)	
#define LPUART0_BASE				(PERIPH_BASE				+0x00010400)
#define LPUART1_BASE				(PERIPH_BASE				+0x00010420)
#define SPI1_BASE						(PERIPH_BASE				+0x00010840)
#define SPI2_BASE						(PERIPH_BASE				+0x00010880)
#define LCD_BASE						(PERIPH_BASE				+0x00010C00)	
#define RTC_BASE						(PERIPH_BASE				+0x00011000)
#define IWDT_BASE						(PERIPH_BASE				+0x00011400)	
#define WWDT_BASE						(PERIPH_BASE				+0x00011800)
#define U7816_BASE					(PERIPH_BASE				+0x00011C00)
#define UART_COMMON_BASE		(PERIPH_BASE				+0x00012008)
#define UART0_BASE					(PERIPH_BASE				+0x0001200C)
#define UART1_BASE					(PERIPH_BASE				+0x0001202C)		
#define UART4_BASE					(PERIPH_BASE				+0x0001208C)	
#define UART5_BASE					(PERIPH_BASE				+0x000120AC)	
#define I2C_BASE						(PERIPH_BASE				+0x00012400)
#define RCC_PDR_BASE		    (PERIPH_BASE				+0x00012800)
#define RCC_BOR_BASE		    (PERIPH_BASE				+0x00012804)
#define PMU_VREF_BASE				(PERIPH_BASE				+0x0001280C)
#define PMU_BUF_BASE				(PERIPH_BASE				+0x00012818)
#define SVD_BASE						(PERIPH_BASE				+0x00012824)
#define RCC_FDET_BASE		    (PERIPH_BASE				+0x00012838)
#define OPA1_BASE						(PERIPH_BASE				+0x00012844)
#define OPA2_BASE						(PERIPH_BASE				+0x00012854)
#define RNG_CR_BASE			    (PERIPH_BASE				+0x00012864)
#define LPTIM_BASE					(PERIPH_BASE				+0x00013400)
#define AES_BASE						(PERIPH_BASE				+0x00013800)
#define RNG_BASE						(PERIPH_BASE				+0x00013C00)
#define ATIM_BASE				    (PERIPH_BASE				+0x00014000)
#define GPTIM0_BASE				  (PERIPH_BASE				+0x00014400)
#define GPTIM1_BASE				  (PERIPH_BASE				+0x00014800)
#define BSTIM_BASE				  (PERIPH_BASE				+0x00014C00)
#define ADC_BASE						(PERIPH_BASE				+0x00015000)
#define BEEP_BASE						(PERIPH_BASE				+0x00015400)

/* ================================================================================ */
/* ================             Peripheral declaration             ================ */
/* ================================================================================ */

#define DBG															((DBG_Type             		*) DBG_BASE					)
#define PMU															((PMU_Type             		*) PMU_BASE					)
#define PMU_VREF												((PMU_VREF_Type           *) PMU_VREF_BASE		)
#define PMU_BUF													((PMU_BUF_Type            *) PMU_BUF_BASE			)
#define RCC													    ((RCC_Type                *) RCC_BASE			    )
#define RCC_PDR											    ((RCC_PDR_Type            *) RCC_PDR_BASE	    )
#define RCC_BOR											    ((RCC_BOR_Type            *) RCC_BOR_BASE	    )
#define DMA															((DMA_Type             		*) DMA_BASE					)
#define GPIOA														((GPIO_Type         			*) GPIOA_BASE				)
#define GPIOB														((GPIO_Type         			*) GPIOB_BASE				)
#define GPIOC														((GPIO_Type         			*) GPIOC_BASE				)
#define GPIOD														((GPIO_Type         			*) GPIOD_BASE				)
#define GPIO_COMMON      								((GPIO_COMMON_Type   			*) GPIO_COMMON_BASE	)
#define FLS														  ((FLS_Type           		  *) FLS_BASE				)
#define CRC															((CRC_Type        				*) CRC_BASE					)
#define LPUART0                         ((LPUART_Type             *) LPUART0_BASE			)
#define LPUART1                         ((LPUART_Type             *) LPUART1_BASE			)
#define SPI1														((SPI_Type            		*) SPI1_BASE				)
#define SPI2														((SPI_Type            		*) SPI2_BASE				)
#define LCD														  ((LCD_Type        				*) LCD_BASE				)
#define RTC															((RTC_Type        				*) RTC_BASE					)
#define IWDT														((IWDT_Type               *) IWDT_BASE				)
#define WWDT														((WWDT_Type               *) WWDT_BASE				)
#define U7816													  ((U7816_Type        			*) U7816_BASE			  )
#define UART_COMMON                     ((UART_COMMON_Type        *) UART_COMMON_BASE	)
#define UART0                           ((UART_Type               *) UART0_BASE				)
#define UART1                           ((UART_Type               *) UART1_BASE				)
#define UART4                           ((UART_Type               *) UART4_BASE				)
#define UART5                           ((UART_Type               *) UART5_BASE				)
#define I2C															((I2C_Type         				*) I2C_BASE					)
#define RCC_FDET										    ((RCC_FDET_Type           *) RCC_FDET_BASE		)
#define SVD														  ((SVD_Type        				*) SVD_BASE				  )
#define OPA1														((OPA_Type        				*) OPA1_BASE				)
#define OPA2														((OPA_Type        				*) OPA2_BASE				)
#define LPTIM													  ((LPTIM_Type        			*) LPTIM_BASE			  )
#define AES                          	  ((AES_Type              	*) AES_BASE					)
#define RNG														  ((RNG_Type        				*) RNG_BASE				)
#define RNG_CR											    ((RNG_CR_Type        	    *) RNG_CR_BASE	)
#define ATIM													  ((ATIM_Type         		  *) ATIM_BASE			  )
#define GPTIM0													((GPTIM_Type         	    *) GPTIM0_BASE			  )
#define GPTIM1													((GPTIM_Type         		  *) GPTIM1_BASE			  )
#define BSTIM													  ((BSTIM_Type         		  *) BSTIM_BASE			  )
#define ADC														  ((ADC_Type        				*) ADC_BASE				  )
#define BEEP														((BEEP_Type        				*) BEEP_BASE				)

/* ================================================================================ */
/* ================             Peripheral include                 ================ */
/* ================================================================================ */

/** @} */ /* End of group Device_Peripheral_Registers */
/** @} */ /* End of group FM33L0XX */
/** @} */ /* End of group Keil */

#ifdef __cplusplus
}
#endif

#endif  /* FM33L0XX_H */
